app/controllers/patrimonios_controller.rb

  def index
    @patrimonios = Patrimonio.all
---
SELECT * FROM `patrimonios` ORDER BY titulo

  def show
    @patrimonio = Patrimonio.find(params[:id])
---
SELECT * FROM `patrimonios` WHERE (`patrimonios`.`id` = 1)

  def edit
    @patrimonio = Patrimonio.find(params[:id])
---
SELECT * FROM `patrimonios` WHERE (`patrimonios`.`id` = 1)

  def create
    @patrimonio = Patrimonio.new(params[:patrimonio])

    respond_to do |format|
      if @patrimonio.save
---
INSERT INTO `patrimonios` (`updated_at`, `motivo`, `situacao`, `descricao`, `created_at`) VALUES('2009-07-15 01:05:07', 'porque sim', 'ativo', 'Tripe', '2009-07-15 01:05:07')